src/Documents/УведомлениеОВвозеПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОВвозеПрослеживаемыхТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюДокументовИмпорта</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПрослеживаемости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКПД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМестаХранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМестХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УведомлениеОПеремещенииПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОПеремещенииПрослеживаемыхТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТоварыОтгруженныеВЕАЭС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПрослеживаемости</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СопроводительныйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СопроводительныйДокументУведомлениеОПеремещении</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранзитныеСтраныЕАЭС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonForms/ФормированиеУведомленийОВвозеПеремещении/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтправитьУведомление;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.УведомлениеОВвозеПрослеживаемыхТоваров");
	ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров");
	
	УстановитьУсловноеОформление();
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТипУведомления.СписокВыбора.Очистить();
	Элементы.ТипУведомления.СписокВыбора.Добавить(ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров, СинонимыСтрокОформления().УведомлениеОВвозе);
	Элементы.ТипУведомления.СписокВыбора.Добавить(ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров, СинонимыСтрокОформления().УведомлениеОВывозе);
	
	Организация = Параметры.Организация;
	Основание = Параметры.Основание;
	КодТНВЭД = Параметры.КодТНВЭД;
	
	Если Параметры.ТипУведомления = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
		ТипУведомления = ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров;	
	ИначеЕсли Параметры.ТипУведомления = Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров") Тогда
		ТипУведомления = ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров;
	КонецЕсли;
		
	УстановитьОтборПоТипуДокументаИмпорта();
	УстановитьОтборПоОрганизации();
	УстановитьОтборПоКодуТНВЭД();
	УстановитьОтборПоТипуУведомления();
	УстановитьОтборПоОснованию();
	
	ОбновитьЗаголовкиГиперссылокНаСервере();
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);  
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)


	Если ИмяСобытия = "Запись_ПриобретениеТоваровУслуг"
		Или ИмяСобытия = "Запись_РеализацияТоваровУслуг"
		Или ИмяСобытия = "Запись_УведомлениеОПрослеживаемыхТоваров" Тогда
		Элементы.КОформлению.Обновить();
	КонецЕсли;

	Если ИмяСобытия = "Запись_УведомлениеОПрослеживаемыхТоваров" Тогда
		ОбновитьЗаголовкиГиперссылокНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НужноУстановитьОтборДинамическогоСписка(КОформлению.Отбор.Элементы, Элементы.Организация, Организация) Тогда	
		УстановитьОтборПоОрганизации();
		ОбновитьЗаголовкиГиперссылокНаСервере();
	КонецЕсли; 
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДПриИзменении(Элемент)
	
	Если НужноУстановитьОтборДинамическогоСписка(КОформлению.Отбор.Элементы, Элементы.КодТНВЭД, КодТНВЭД) Тогда	
		УстановитьОтборПоКодуТНВЭД();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипУведомленияПриИзменении(Элемент)
	
	Если НужноУстановитьОтборДинамическогоСписка(КОформлению.Отбор.Элементы, Элементы.ТипУведомления, ТипУведомления) Тогда
		УстановитьОтборПоТипуУведомления();	
		ОбновитьЗаголовкиГиперссылокНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если НужноУстановитьОтборДинамическогоСписка(КОформлению.Отбор.Элементы, Элементы.Основание, Основание) Тогда
		УстановитьОтборПоОснованию();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОтправитьНажатие(Элемент)
	
	ОткрытьФормуУведомлений("ОжидаютОтправки");
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОжидатьНажатие(Элемент)
	
	ОткрытьФормуУведомлений("ОжидаютПолучения");
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаАрхивНажатие(Элемент)
	
	ОткрытьФормуУведомлений("Завершены");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьИОтправитьУведомление(Команда)  

	ОтправитьУведомление = Истина;
	СоздатьИОтправитьУведомленияНаКлиенте(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомление(Команда) 
	
	ОтправитьУведомление = Ложь;
   	СоздатьИОтправитьУведомленияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура УстановитьОтборПоОрганизации()
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		КОформлению,
		"Организация",
		Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		"Организация",
		ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКодуТНВЭД()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		КОформлению,
		"АналитикаУчетаНоменклатуры.Номенклатура.КодТНВЭД",
		КодТНВЭД,
		ВидСравненияКомпоновкиДанных.Равно,
		"КодТНВЭД",
		ЗначениеЗаполнено(КодТНВЭД));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		КОформлению,
		"Номенклатура.КодТНВЭД",
		КодТНВЭД,
		ВидСравненияКомпоновкиДанных.Равно,
		"КодТНВЭД",
		ЗначениеЗаполнено(КодТНВЭД));
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипуУведомления()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		КОформлению,
		"ТипУведомления",
		ТипУведомления,
		ВидСравненияКомпоновкиДанных.Равно,
		"ТипУведомления",
		ЗначениеЗаполнено(ТипУведомления));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОснованию()
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		КОформлению,
		"Основание",
		Основание,
		ВидСравненияКомпоновкиДанных.Равно,
		"Основание",
		ЗначениеЗаполнено(Основание));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипуДокументаИмпорта()
	
	СписокТиповДокументов = Новый СписокЗначений;
	СписокТиповДокументов.Добавить(ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров);
	КОформлению.Параметры.УстановитьЗначениеПараметра("ТипДокументаИмпорта", СписокТиповДокументов);
	КОформлению.Параметры.УстановитьЗначениеПараметра("ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров", ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КОформлениюТипУведомления.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КОформлению.ТипУведомления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", СинонимыСтрокОформления().УведомлениеОВвозе);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КОформлениюТипУведомления.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КОформлению.ТипУведомления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ИдентификаторУведомлениеОПеремещенииПрослеживаемыхТоваров;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", СинонимыСтрокОформления().УведомлениеОВывозе);
		
КонецПроцедуры

&НаКлиенте
Функция НужноУстановитьОтборДинамическогоСписка(ЭлементыОтбора, ЭлементФормы, ПроверяемоеЗначение)
	Результат = Ложь;
	ЭлементОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(КОформлению.Отбор.Элементы, ЭлементФормы.Имя);
	Если ЭлементОтбора = Неопределено
		Или ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение <> ПроверяемоеЗначение
		Или Не ЭлементОтбора.Использование И ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда
		Результат = Истина;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СоздатьИОтправитьУведомленияНаКлиенте()  
	
	ВыделенныеСтроки  = Элементы.КОформлению.ВыделенныеСтроки;
	ДанныеКОформлению = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = Элементы.КОформлению.ДанныеСтроки(ИдентификаторСтроки);
		СтруктураДанныхКОформлению = СтруктураДанныхКОформлению();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхКОформлению,ВыделеннаяСтрока);
		ДанныеКоформлению.Добавить(СтруктураДанныхКОформлению);
	КонецЦикла;
	
	Если ДанныеКОформлению.Количество() > 0 Тогда 
				
		ДлительнаяОперация = СоздатьУведомленияНаСервереВФоне(ДанныеКОформлению);
		
		Если ДлительнаяОперация = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
			НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			НастройкиОжидания.ВыводитьОкноОжидания = Истина;
			
			Обработчик = Новый ОписаниеОповещения("ПослеСозданияУведомлений", ЭтотОбъект);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		Иначе
			ПоказатьОшибкуСозданияУведомления(ДлительнаяОперация);			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость() 
	
	ПодключенДО = Ложь;
	
		
	Элементы.КОформлениюСоздатьИОтправитьУведомление.Видимость = ПодключенДО;
			
	Элементы.КОформлениюСоздатьИОтправитьУведомление.КнопкаПоУмолчанию = ПодключенДО;
	Элементы.КОформлениюСоздатьУведомление.КнопкаПоУмолчанию = НЕ ПодключенДО;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанныхКОформлению()
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Организация");
	СтруктураДанных.Вставить("КодТНВЭД");
	СтруктураДанных.Вставить("ТипУведомления");
	СтруктураДанных.Вставить("Основание");
	Возврат СтруктураДанных;
	
КонецФункции	
	
&НаКлиенте
Процедура ПослеСозданияУведомлений(ДлительнаяОперация, ДополнительныеПараметры) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат; // Отменено
	КонецЕсли;

	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		Оповестить("Запись_УведомлениеОПрослеживаемыхТоваров");
		
		УведомленияДляОтправкиВФНС.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата));  
		
		 
	Иначе      
		
		ПоказатьОшибкуПолученияДанных(ДлительнаяОперация);

	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура ПоказатьОшибкуПолученияДанных(ДлительнаяОперация)
	
	МассивИзДвухСтрок = Новый Массив;
	МассивИзДвухСтрок.Добавить(НСтр("ru = 'Ошибка при получении данных:'"));
	МассивИзДвухСтрок.Добавить(ДлительнаяОперация.КраткоеПредставлениеОшибки);
	
	ВызватьИсключение СтрСоединить(МассивИзДвухСтрок, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуСозданияУведомления(ДлительнаяОперация)
	
	МассивИзДвухСтрок = Новый Массив;
	МассивИзДвухСтрок.Добавить(НСтр("ru = 'Ошибка при создании уведомления..'"));
	МассивИзДвухСтрок.Добавить(ДлительнаяОперация.КраткоеПредставлениеОшибки);
	
	ВызватьИсключение СтрСоединить(МассивИзДвухСтрок, Символы.ПС);
	
КонецПроцедуры

&НаСервере
Функция СоздатьУведомленияНаСервереВФоне(ДанныеКОформлению)
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеКОформлению", ДанныеКОформлению); 
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание уведомлений'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ПрослеживаемостьУП.СоздатьУведомленияВФоне",        
	    ПараметрыОбработчика,
		НастройкиЗапуска);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Функция СинонимыСтрокОформления()
	
	Результат = Новый Структура;
	Результат.Вставить("УведомлениеОВвозе", НСтр("ru = 'Уведомление о ввозе'"));
	Результат.Вставить("УведомлениеОВывозе", НСтр("ru = 'Уведомление о перемещении'"));
	Возврат Результат;
	
КонецФункции

#Область ОбменСКО

&НаКлиенте
Процедура ОткрытьФормуУведомлений(Состояние)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Состояние", Состояние);
	
	Если ЗначениеЗаполнено(ТипУведомления) Тогда
		
		Если ТипУведомления = ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров Тогда
			ПараметрыФормы.Вставить("ТипУведомления", Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров"));
		Иначе
			ПараметрыФормы.Вставить("ТипУведомления", Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров"));
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяФормыУведомлений = "ЖурналДокументов.ПрослеживаемостьУведомления.ФормаСписка";
	
	ОткрытьФорму(
		ИмяФормыУведомлений,
		ПараметрыФормы,
		,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиГиперссылок(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьЗаголовкиГиперссылокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиГиперссылокНаСервере()
	
	МассивОрганизаций = ?(ЗначениеЗаполнено(Организация), ОбщегоНазначенияУТКлиентСервер.Массив(Организация), Неопределено);

	ВидимостьЭлементаГиперссылкаОжидать = Истина;
			
	ТипыУведомлений = Новый Массив;
	Если ЗначениеЗаполнено(ТипУведомления) Тогда
		Если ТипУведомления = ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров Тогда 
			ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров"));			
		Иначе
			ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров"));  
			ВидимостьЭлементаГиперссылкаОжидать = Ложь;	
		КонецЕсли;
	Иначе
		ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров"));
		ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров"));
	КонецЕсли;
	
	КоличестваУведомленийКОформлению =
		ЖурналыДокументов.ПрослеживаемостьУведомления.СтатистикаОтправкиУведомлений(ТипыУведомлений, МассивОрганизаций);
	
	ШаблонЗаголовокЭлементаОтправить = НСтр("ru = 'Отправить %1'");
	ШаблонЗаголовокЭлементаОжидать = НСтр("ru = 'Ожидать получения РНПТ %1'");
	ШаблонЗаголовокЭлементаАрхив = НСтр("ru = 'Архив %1'");
	
	КоличествоКОформлениюОтправить = 0;
	КоличествоКОформлениюОжидать = 0;
	КоличествоКОформлениюАрхив = 0;
	
	Для Каждого КлючЗначение Из КоличестваУведомленийКОформлению Цикл
		
		КоличествоКОформлениюОтправить = КоличествоКОформлениюОтправить + КлючЗначение.Значение.ОжидаютОтправки;
		КоличествоКОформлениюОжидать = КоличествоКОформлениюОжидать + КлючЗначение.Значение.ОжидаютПолучения;
		КоличествоКОформлениюАрхив = КоличествоКОформлениюАрхив + КлючЗначение.Значение.Завершены;
	
	КонецЦикла;
	
	ЗаголовокЭлементаОтправить =
		СтрШаблон(
			ШаблонЗаголовокЭлементаОтправить,
			?(ЗначениеЗаполнено(КоличествоКОформлениюОтправить), "(" + Строка(КоличествоКОформлениюОтправить) + ")", ""));
	
	ЗаголовокЭлементаОжидать =
		СтрШаблон(
			ШаблонЗаголовокЭлементаОжидать,
			?(ЗначениеЗаполнено(КоличествоКОформлениюОжидать), "(" + Строка(КоличествоКОформлениюОжидать) + ")", ""));
	
	ЗаголовокЭлементаАрхив =
		СтрШаблон(
			ШаблонЗаголовокЭлементаАрхив,
			?(ЗначениеЗаполнено(КоличествоКОформлениюАрхив), "(" + Строка(КоличествоКОформлениюАрхив) + ")", ""));
	
	Элементы.ГиперссылкаОтправить.Заголовок = СокрЛП(ЗаголовокЭлементаОтправить);
	Элементы.ГиперссылкаОжидать.Заголовок 	= СокрЛП(ЗаголовокЭлементаОжидать);
	Элементы.ГиперссылкаАрхив.Заголовок 	= СокрЛП(ЗаголовокЭлементаАрхив);
	
	Элементы.ГиперссылкаОжидать.Видимость = ВидимостьЭлементаГиперссылкаОжидать;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
